pet-me-backend/app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches"
---
  def index
    @matches = Match.all

INSERT INTO "matches" ("user_id", "pet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["pet_id", 44573780], ["created_at", "2019-04-29 20:45:53.899323"], ["updated_at", "2019-04-29 20:45:53.899323"]]
---
  def create
    @match = Match.create(match_params)

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @match = Match.find(params[:id])

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 1]]
---
  def delete
    @match = Match.find(params[:id])
    @match.destroy