pet-me-backend/app/controllers/pets_controller.rb

INSERT INTO "pets" ("name", "gender", "description", "age", "adoption_id", "img_medium", "img_large", "img_small", "img_full", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @pet = Pet.create(pet_params)